In [70]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

## Some values in the the FlightNumber column are missing. 
## These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. 
## Fill in these missing numbers and make the column an integer column(instead of a float column).

In [71]:
#Records with NAs in 'FlightNumber'
res = list(np.where(df["FlightNumber"].isnull() == True))
#Replace null values with corresponding incremental values
for i in res:
    df["FlightNumber"][i] = df["FlightNumber"][0] + (i*10)

#convert the data type from float to int    
df["FlightNumber"] = df["FlightNumber"].astype(int)
df.dtypes

C:\Users\vinay\anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

## The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [72]:
df1 = pd.DataFrame()
# df1.describe
df1["From"] = df["From_To"].str.split("_").str[0]
df1["To"] = df["From_To"].str.split("_").str[1]
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [73]:
df1["From"] = df1["From"].str.capitalize()
df1["To"] = df1["To"].str.capitalize()
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [74]:
df = df.drop(columns = "From_To")
df["From"] = df1["From"]
df["To"] = df1["To"]
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
## Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [76]:
delays = pd.DataFrame(df["RecentDelays"].to_list())

for i in range(0,len(delays.columns)):
    delays.rename(columns = {delays.columns[i]:('delays_'+ str(i))}, inplace = True)
    
delays

   delays_0  delays_1  delays_2
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN

In [77]:
df.drop(columns = "RecentDelays", inplace = True)
df[delays.columns] = delays
df

,FlightNumber,Airline,From,To,delays_0,delays_1,delays_2
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN